desktop.org
** Desktop Configuration
:PROPERTIES:
:CREATED:  [2021-11-13 Sat 11:38]
:ID:       e0ffad02-0ae8-4b82-a66b-897c5aeae524
:END:

#+begin_src emacs-lisp :tangle ~/.doom.d/modules/desktop/exwm/+desktop.el

(defun nanjigen/run-xmodmap ()
  (interactive)
  (start-process-shell-command "xmodmap" nil "xmodmap ~/.dotfiles/.config/i3/Xmodmap"))

(defun nanjigen/update-wallpapers ()
  (interactive)
  (start-process-shell-command
   "feh" nil
   (format "feh --bg-scale ~/.dotfiles/backgrounds/%s" (alist-get 'desktop/background nanjigen/system-settings))))

(setq nanjigen/panel-process nil)
(defun nanjigen/kill-panel ()
  (interactive)
  (when nanjigen/panel-process
    (ignore-errors
      (kill-process nanjigen/panel-process)))
  (setq nanjigen/panel-process nil))

(defun nanjigen/start-panel ()
  (interactive)
  (nanjigen/kill-panel)
  (setq nanjigen/panel-process (start-process-shell-command "polybar" nil "polybar panel")))

(defun nanjigen/update-screen-layout ()
  (interactive)
  (let ((layout-script "~/.bin/update-screens"))
     (message "Running screen layout script: %s" layout-script)
     (start-process-shell-command "xrandr" nil layout-script)))

(defun nanjigen/configure-desktop ()
  (interactive)
    (nanjigen/run-xmodmap)
    (nanjigen/update-screen-layout)
    (run-at-time "2 sec" nil (lambda () (nanjigen/update-wallpapers))))

(defun nanjigen/on-exwm-init ()
  (nanjigen/configure-desktop)
  (nanjigen/start-panel))

;; (when nanjigen/exwm-enabled
;;   ;; Configure the desktop for first load
;;   (add-hook 'exwm-init-hook #'nanjigen/on-exwm-init))

#+end_src

** Panel
:PROPERTIES:
:CREATED:  [2021-11-13 Sat 11:38]
:ID:       47c59749-c9a0-486f-92fa-005afce53ee3
:END:

#+begin_src emacs-lisp :tangle ~/.doom.d/modules/desktop/exwm/+desktop.el
;;; desktop/exwm/+desktop.el -*- lexical-binding: t; -*-

(defun nanjigen/send-polybar-hook (name number)
  (start-process-shell-command "polybar-msg" nil (format "polybar-msg hook %s %s" name number)))

(defun nanjigen/update-polybar-exwm (&optional path)
  (nanjigen/send-polybar-hook "exwm" 1)
  (nanjigen/send-polybar-hook "exwm-path" 1))

;; (defun nanjigen/update-polybar-telegram ()
;;   (nanjigen/send-polybar-hook "telegram" 1))

(defun nanjigen/polybar-exwm-workspace ()
  (pcase exwm-workspace-current-index
    (0 "")
    (1 "")
    (2 "")
    (3 "")
    (4 "")))

(defun nanjigen/polybar-exwm-workspace-path ()
  (let ((workspace-path (frame-parameter nil 'bufler-workspace-path-formatted)))
    (if workspace-path
        (substring-no-properties workspace-path)
      "")))

(defun nanjigen/polybar-mail-count (max-count)
  (if (and nanjigen/mail-enabled nanjigen/mu4e-inbox-query)
    (let* ((mail-count (shell-command-to-string
                         (format "mu find --nocolor -n %s \"%s\" | wc -l" max-count nanjigen/mu4e-inbox-query))))
      (format " %s" (string-trim mail-count)))
    ""))

(defun nanjigen/telega-normalize-name (chat-name)
  (let* ((trimmed-name (string-trim-left (string-trim-right chat-name "}") "◀{"))
         (first-name (nth 0 (split-string trimmed-name " "))))
    first-name))

(defun nanjigen/propertized-to-polybar (buffer-name)
  (if-let* ((text (substring-no-properties buffer-name))
            (fg-face (get-text-property 0 'face buffer-name))
            (fg-color (face-attribute fg-face :foreground)))
    (format "%%{F%s}%s%%{F-}" fg-color (nanjigen/telega-normalize-name text))
    text))

;; (defun nanjigen/polybar-telegram-chats ()
;;   (if (> (length tracking-buffers) 0)
;;     (format " %s" (string-join (mapcar 'nanjigen/propertized-to-polybar tracking-buffers) ", "))
;;     ""))

(add-hook 'exwm-workspace-switch-hook #'nanjigen/update-polybar-exwm)
(add-hook 'bufler-workspace-set-hook #'nanjigen/update-polybar-exwm)

#+end_src


* Automatic Disk Mounting with Udiskie
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       c111674c-0ad4-41a8-a4bc-51706c0df2d7
:END:

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"udiskie"

#+end_src

* Default Applications
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       74c87dcd-4869-408a-b0f9-b83c5450d949
:END:

The file =~/.config/mimeapps.list= configures default applications for various content types.  Right now I'm using it to control which browser opens URLs from other applications.

#+begin_src conf :tangle ~/.config/mimeapps.list

  [Default Applications]
  text/html=firefox.desktop
  x-scheme-handler/http=firefox.desktop
  x-scheme-handler/https=firefox.desktop
  x-scheme-handler/about=firefox.desktop
  x-scheme-handler/unknown=firefox.desktop
  x-scheme-handler/org-protocol=org-protocol.desktop
  application/pdf=emacsclient.desktop;mupdf.desktop;libreoffice-draw.desktop

#+end_src

* User Services
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       5d712d72-2f6a-4e02-9f77-062512443956
:END:

I use [[https://www.gnu.org/software/shepherd/][GNU Shepherd]] to manage services that run in the background when I log in.

#+begin_src scheme :tangle ~/.config/shepherd/init.scm

(define gpg-agent
  (make <service>
    #:provides '(gpg-agent)
    #:respawn? #t
    #:start (make-system-constructor "gpg-connect-agent /bye")
    #:stop (make-system-destructor "gpgconf --kill gpg-agent")))

(define mcron
  (make <service>
    #:provides '(mcron)
    #:respawn? #t
    #:start (make-forkexec-constructor '("mcron"))
    #:stop  (make-kill-destructor)))

(define syncthing
  (make <service>
    #:provides '(syncthing)
    #:respawn? #t
    #:start (make-forkexec-constructor '("syncthing" "-no-browser"))
    #:stop  (make-kill-destructor)))

(define pulseaudio
  (make <service>
    #:provides '(pulseaudio)
    #:respawn? #t
    #:start (make-forkexec-constructor '("pulseaudio"))
    #:stop  (make-kill-destructor)))

(register-services gpg-agent mcron syncthing pulseaudio)
(action 'shepherd 'daemonize)

;; Start user services
(for-each start '(gpg-agent mcron syncthing pulseaudio))

#+end_src

* Scheduled Tasks
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       a3443352-278d-4f3a-a70d-b267e67c17a1
:END:

I use [[https://www.gnu.org/software/mcron/][GNU mcron]] for scheduling tasks to run periodically in the background.

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"mcron"

#+end_src

** TODO setup Guix battery notification
:PROPERTIES:
:CREATED:  [2022-02-25 Fri 18:13]
:ID:       30df41e6-c098-4e8f-ba5c-164b3cd7ac5e
:END:
https://guix.gnu.org/zh-CN/manual/en/html_node/Scheduled-Job-Execution.html
Using mcron

* Applications
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       e52ef51e-6f8d-40bb-84cc-ed6b529741df
:END:

** Browsers
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       0adab059-07d5-444a-85a6-e072e55a7bf1
:END:

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"nyxt"

#+end_src

*** nyxt
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 16:04]
:ID:       d8324ada-b16a-48f2-ab9a-f92f023d69ba
:END:

** Password Management
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       7c10e52c-8e0e-42bc-980e-af048a02dce9
:END:

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"password-store"

#+end_src

** Audio Device Control
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       f002285a-4de2-4b08-bf55-f827c4edbe28
:END:

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"alsa-utils"
"pavucontrol"

#+end_src

** Media Players
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       bd06b4d3-0009-4c6e-a556-0894e8bb2fff
:END:

*** TODO rewrite mpv config in fennel
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       3a0bba28-68c7-4966-a1a7-214978fadda3
:END:

[[https://mpv.io/][mpv]] is a simple yet powerful video player.  Paired with [[http://ytdl-org.github.io/youtube-dl/][youtube-dl]] it can even stream YouTube videos.  [[https://github.com/hoyon/mpv-mpris][mpv-mpris]] allows playback control via [[https://github.com/altdesktop/playerctl][playerctl]].

#+begin_src conf :tangle ~/.config/mpv/mpv.conf :noweb yes

# Configure playback quality
vo=gpu
hwdec=vaapi
profile=gpu-hq
scale=ewa_lanczossharp
cscale=ewa_lanczossharp

# Start the window in the upper right screen corner
geometry=22%-30+20

# Save video position on quit
save-position-on-quit

# Enable control by MPRIS
script=~/.guix-extra-profiles/desktop/desktop/lib/mpris.so

# Limit the resolution of YouTube videos
ytdl=yes
ytdl-format=bestvideo[height<=?720]+bestaudio/best

# When playing audio files, display the album art
audio-display=attachment

# Keep the player open after the file finishes
keep-open

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"mpv"
"mpv-mpris"
"youtube-dl"
"playerctl"

#+end_src

*** Codecs and Drivers
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       9ebfe5cc-204b-4588-ba1e-a36e283f1664
:END:

These packages are needed to enable many video formats to be played in browsers and video players.  VAAPI drivers are also used to enable hardware-accelerated video decoding.

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"gstreamer"
"gst-plugins-base"
"gst-plugins-good"
"gst-plugins-bad"
"gst-plugins-ugly"
"gst-libav"
"libva-utils"
"ffmpeg"

#+end_src

** Image Viewers and Editors
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       aa9e6c67-7555-4dd7-a3ee-735330f816d9
:END:

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"feh"
"gimp"
"scrot"

#+end_src

** Document Readers
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       55bbc078-10fe-4474-9d5d-6f698069c63c
:END:

I use ~emacs-pdf-tools~ extensively. Installing it via ~guix~ takes care of building everything much more reliably than as a ~straight~ package.

~Libreoffice~ for dealing with the odd non-text document.
*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"emacs-pdf-tools"

#+end_src

** Syncthing
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       fec6c914-f377-40d4-8a59-b9baac602278
:END:

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"syncthing"
"syncthing-gtk"

#+end_src

** Flatpak
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       39571a84-622b-4817-8e0f-56d1d19a6201
:END:

I use Flatpak and the [[https://flathub.org/home][Flathub]] repository to install applications that are otherwise difficult to install in Guix because of application frameworks, etc.

*Applications to Install*

#+begin_src sh

# flatpak remote-add --user --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo
# flatpak remote-add --user --if-not-exists flathub-beta https://flathub.org/beta-repo/flathub-beta.flatpakrepo
# flatpak install --user flathub com.spotify.Client
# flatpak install --user flathub com.valvesoftware.Steam
# flatpak install --user flathub com.microsoft.Teams
# flatpak install --user flathub com.discordapp.Discord
# flatpak install --user flathub-beta com.obsproject.Studio

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"flatpak"

#+end_src

** Printing
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       09bc7c8b-8419-47a5-8b14-999723b6f0d1
:END:

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"system-config-printer"

#+end_src

** Desktop Tools
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       d7dd2e0c-d13c-4a9d-aa0d-550a8f58642b
:END:

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"compton"
"redshift"
"gucharmap"
"fontmanager"
"brightnessctl"
"xdg-utils"      ;; For xdg-open, etc
"xdg-dbus-proxy" ;; For Flatpak
"gtk+:bin"       ;; For gtk-launch
"glib:bin"       ;; For gio-launch-desktop
"shared-mime-info"

#+end_src

** System Tools
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       f060d6b1-d5be-41fd-af19-e4263f5cf33b
:END:

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"openssh"
"zip"
"unzip"

#+end_src

** Xorg Tools
:PROPERTIES:
:CREATED:  [2021-09-22 Wed 13:54]
:ID:       5660e7af-f72b-4493-8dec-d18eb96655c6
:END:

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"xev"
"xset"
"xrdb"
"xhost"
"xmodmap"
"setxkbmap"
"xrandr"
"arandr"
"xss-lock"
"libinput"
"xinput"

#+end_src

